app/views/pages/view_details.html.erb

SELECT "item_reviews".* FROM "item_reviews" WHERE "item_reviews"."review_id" = ?  [["review_id", 29]]
SELECT "reviews".* FROM "reviews"  ORDER BY "reviews"."id" DESC
---

				<% Review.all.reverse_order.each do |r| %>