app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "description", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["rating", 2.0], ["description", "ok"], ["restaurant_id", "blue-mango-san-jose-2"], ["created_at", "2017-08-06 03:44:37.000539"], ["updated_at", "2017-08-06 03:44:37.000539"]]
INSERT INTO "images" ("file_file_name", "file_content_type", "file_file_size", "file_updated_at", "review_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@review = Review.new(review_params)
		@review.restaurant_id = params[:restaurant_id]
		puts params
		if @review.save
			if params[:files]
		        #===== The magic is here ;)
		        params[:files].each { |f|
		          @review.images.create(file: f)